{
  "entries": [
    {
      "date": "2020-01-19",
      "concepts": "Data collection with objects",
      "entry": "In this exercise we covered how to record data input using objects and their properties.",
      "mood": "happy",
      "id": 4
    },
    {
      "date": "2020-02-03",
      "concepts": "Posting data to database.",
      "entry": "Kristen helped me fix some syntax issues so that user input would get posted to the DB.",
      "mood": "happy",
      "id": 5
    },
    {
      "date": "2020-02-11",
      "concepts": "Editing data in database part 3.",
      "entry": "Changing nested save btn event listener syntax as original code was not being read.",
      "mood": "happy",
      "id": 7
    },
    {
      "date": "2020-02-08",
      "concepts": "I got the filtered data display working!",
      "entry": "This morning right after I woke up I was able to quickly fix what I was having so much trouble with yesterday. First I had to fix my import syntax to match my exports. Then I had to import the container element that holds the JSON data on the DOM correctly (not as one feature but in a list in {}. Then, in the click event for each mood-filtering button, before I ran the method that display the JSON data to the DOM I reset my container element to an empty string, so that each time a btn is clicked the container would empty itself and then display the corresponding data.",
      "mood": "happy",
      "id": 8
    },
    {
      "date": "2020-02-08",
      "concepts": "Run http-server before json-server!",
      "entry": "Just learned that if I start json-server before starting the http-server I will get errors on page load. Need to start http-server first always!",
      "mood": "fine",
      "id": 9
    },
    {
      "date": "2020-02-10",
      "concepts": "Editing data in database.",
      "entry": "Practicing editing data in database.",
      "mood": "happy",
      "id": 10
    },
    {
      "date": "2020-02-11",
      "concepts": "Editing data in database.",
      "entry": "Trying to update save btn functionality depending on if editing existing entry or creating a new entry.\n\nFIXED! Needed my conditional for the save button to differentiate edit mode vs create mode to be in the global namespace for when edit button is not clicked on.. I put this new conditional in a function so that I could also use it in edit mode after edit button clicked. Wohooo!",
      "mood": "happy",
      "id": 14
    },
    {
      "date": "2020-02-11",
      "concepts": "Have to make sad entry for filtering",
      "entry": "Very sad... Like.....VERY ....",
      "mood": "sad",
      "id": 15
    },
    {
      "id": 16
    },
    {
      "id": 17
    }
  ]
}